Repository: WPPlugins/estonian-banklinks-for-woocommerce
Catalog: languages/wc-gateway-estonia-banklink-*.po
Languages: et

source: Request URL
et: Päringu URL

source: Account ID
et: Konto ID

source: Your Private Key
et: Sinu privaatne võti

source: Private Key Password
et: Privaatse võtme parool

source: Bank`s Public Key
et: Panga avalik võti

source: Default language
et: Vaikimisi keel

source: Default UI language locale sent to the bank. Currently supported: et, en, ru. Defaults to et.
et: Vaikimisi kasutajaliidese keel. Hetkel toetatud et, en, ru. Vaikimisi et.

source: Payment completed.
et: Makse teostatud.

source: Payment not made or is not verified.
et: Makse pole teostatud või ei ole kinnitatud.

source: Order nr. %s payment
et: Tellimuse %s makse

source: Pay
et: Maksa

source: Account number
et: Konto number

source: MAC Key
et: MAC võti

source: MAC Key version
et: MAC võtme versioon

source: Preferred language
et: Eelistatud keel

source: Finnish
et: Soome

source: English
et: Inglise

source: Estonian
et: Eesti

source: Latvian
et: Läti

source: Lithuanian
et: Leedu

source: Enable banklink
et: Aktiveeri pangalink

source: Enable this payment gateway
et: Aktiveeri see maksemeetod

source: Title
et: Pealkiri

source: This controls the title which user sees during checkout.
et: See määrab nimetuse, mida kasutaja kassas näeb.

source: Customer message
et: Teade kliendile

source: This will be visible when user selects this payment gateway during checkout.
et: See on nähtav, kui kasutaja valib kassas selle maksemeetodi.

source: Enter full URL to set a custom logo. You could upload the image to your media library first.
et: Enda logo kasutamiseks sisesta selle täielik URL. Selle saad laadida üles enda meediateeki.

source: Country availability
et: Maade saadavus

source: All countries
et: Kõik riigid

source: Specify countries where this method should be available. Select only "all countries" to sell everywhere.
et: Määra riigid, kus see meetod peaks olema saadaval. Kõikjal müümiseks vali "kõik riigid"

source: Thank you for your order, please click the button below to pay with %s in case automatic redirection does not work.
et: Täname tellimuse eest. Kui automaatne suunamine ei tööta, vajutage palun allolevat nuppu maksmiseks %s abil.

source: Destination URL
et: Sihtkoha URL

source: Default UI language locale sent to the bank. Currently supported: et, en, fi, de. Defaults to et.
et: Vaikimisi kasutajaliidese keel, mis saadetakse pangale. Hetkel toetatud et, en, fi, de. Vaikimisi et.

source: Liisi
et: Liisi järelmaks

source: Currency
et: Valuuta

source: Shop ID
et: Poe ID

source: This will be provided by Maksekeskus
et: See antakse Maksekeskuse poolt

source: API secret
et: API salajane võti

source: Preferred locale
et: Eelistatud keel

source: RFC-2616 format locale
et: RFC-2616 formaadis keelekood

source: URL, where customer is redirected to start the payment.
et: URL, kuhu klient saadetakse makse alustamiseks.

source: Return URL
et: Naasmise URL

source: URL, where customer is redirected after the payment.
et: URL, kuhu klient saadetakse peale maksmist.

source: Payment cancelled.
et: Makse katkestati.

source: Nordea payment gateway via SOLO protocol. Use for older clients.
et: Nordea pangalingi maksemeetod SOLO protokolliga. Kasutusel vanematel Nordea klientidel.

source: Nordea payment gateway via IPIZZA protocol. Use for new clients.
et: Nordea pangalingi maksemeetod IPIZZA protokolliga. Kasutusel uuematel Nordea klientidel.
